/*****************************************************************
 * 코 드 명 : ObjectToHit.cs
 * 작 성 자 : 임 병 록
 * 작 성 일 : 2022.06.22
 * 설    명 : 오브젝트가 피격 시에 나타나는 동작을 구현한다.
******************************************************************/
/*include될 헤더*/
using System.Collections;
using System.Collections.Generic;
using UnityEngine;

/****************************************************************
 * 설명 : 오브젝트 피격 시의 이벤트를 구현한다.
*****************************************************************/
public class ObjectToHit : MonoBehaviour
{
    public float objectHealth = 100f;            //오브젝트 체력

/****************************************************************
 * 설명 : 오브젝트에 데미지를 입힌다.
*****************************************************************/
    public void ObjectHitDamage(float hitDamage)
    {
        objectHealth -= hitDamage;
        if(objectHealth <= 0f)
        {
            Die();
        }
    }

/****************************************************************
 * 설명 : objectHealth가 다 깎인 오브젝트를 Destroy한다.
*****************************************************************/
    void Die()
    {
        Destroy(gameObject);
    }
}
